/****************************************************************************
* 文 件 名: main.c
* 作    者: Andy
* 修    订: 2013-01-10
* 版    本: 1.0
* 描    述: 继电器接开发板P9座子上，使用P0.5口控制继电器的信息端，
*           高电平继电器断开;低电平继电器吸合，并且继电器吸合指示灯亮 
****************************************************************************/
#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;

#define DATA_PIN P1_3        //定义P0.5定义为输入口

/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时 16M时约为535,系统时钟不修改默认为16M
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    
    for (i=0; i<msec; i++)
        for (j=0; j<535; j++);
}


void main(void)
{      
    P1DIR |= 0x08;           //P0.5定义为输出口 
    while(1)                 //死循环,继电器间隔3秒开关一次
    {
        DATA_PIN = 1;        //继电器断开
        DelayMS(1000);
        DATA_PIN = 0;        //继电器吸合
        DelayMS(1000);
    }    
}
