/****************************************************************************
* 文 件 名: main.c
* 作    者: Andy
* 修    订: 2013-01-10
* 版    本: 1.0
* 描    述: 蜂鸣器接开发板的P12座子上，也就是人体红外的座子上，然后使用P05控制蜂鸣器
****************************************************************************/
#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;

#define DATA_PIN P0_0        //定义P0.5定义为蜂鸣器控制口

/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时 16M时约为535,系统时钟不修改默认为16M
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    
    for (i=0; i<msec; i++)
        for (j=0; j<535; j++);
}


void main(void)
{      
    P0DIR |= 0x01;           //P0.5定义为输出口 
    while(1)                 //死循环,蜂鸣器间隔3秒开关一次
    {
        DATA_PIN = 1;        //蜂鸣器叫
        DelayMS(3000);
        DATA_PIN = 0;        //蜂鸣器灭
        DelayMS(3000);
    }    
}
