/****************************************************************************
* 文 件 名: main.c
* 作    者: Daniel Peng
* 修    订: 2022-4-10
* 版    本: 1.0
* 描    述: 继电器接开发板P9座子上，使用P1.3口控制继电器的信息端，
*           高电平继电器断开;低电平继电器吸合，并且继电器吸合指示灯亮 
****************************************************************************/
#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;

#define LED1 P1_0       //定义P1.0口为LED1控制端
#define LED2 P1_1       //定义P1.1口为LED2控制端
#define LED3 P1_4       //定义P1.4口为LED3控制端

#define HONGWAI P0_5 //定义P0.5口为红外控制端

#define BEEP P0_0        //定义P0.0定义为蜂鸣器控制口
/****************************************************************************
* 名    称: InitBeep()
* 功    能: 初始化蜂鸣器，默认关闭
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitBeep(void)
{
	P0DIR |= 0x01;    //P0.0定义为输出口 
	BEEP = 0;        //蜂鸣器灭
}

void main( void )
{
	InitBeep();

	P0SEL &= ~0x20; 
	P0DIR &= ~0x20;  
	P1DIR |= 0x13; 

	LED1 = 0;
	LED2 = 0;
	LED3 = 0;


	while(1)
	{

		if(HONGWAI == 1)
			LED1 = 1;
		if(HONGWAI == 0)
			LED1 = 0;
	}
} // end of main()
