/****************************************************************************
* 文 件 名: main.c
* 作    者: Andy
* 修    订: 2013-01-08
* 版    本: 1.0
* 描    述: 操作IO口控制4盏LED灯的全亮和全灭、闪烁、流水灯
****************************************************************************/
#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;

#define LED1 P1_0       //定义P1.0口为LED1控制端
#define LED2 P1_1       //定义P1.1口为LED2控制端
#define LED3 P1_4       //定义P1.4口为LED3控制端


#define BEEP P0_0        //定义P0.5定义为蜂鸣器控制口

/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时，系统时钟不配置时默认为16M(用示波器测量相当精确)
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    
    for (i=0; i<msec; i++)
        for (j=0; j<535; j++);
}

/****************************************************************************
* 名    称: LedOnOrOff()
* 功    能: 点亮或熄灭所有LED灯    
* 入口参数: mode为0时LED灯亮  mode为1时LED灯灭
* 出口参数: 无
****************************************************************************/
void LedOnOrOff(uchar mode)
{
    LED1 = mode;
    LED2 = mode;
    LED3 = mode; 
}

/****************************************************************************
* 名    称: InitLed()
* 功    能: 设置LED灯相应的IO口
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitLed(void)
{
    P1DIR |= 0x13;      //P1.0、P1.1定义为输出
    BEEP(0);      //使所有LED灯默认为熄灭状态
}

void InitBeep(void)
{
	P0DIR |= 0x01;           //P0.0定义为输出口 
	DATA_PIN = 0;        //蜂鸣器灭
}
/****************************************************************************
* 程序入口函数
****************************************************************************/
void main(void)
{
    uchar i;

	InitBeep();

	
    InitLed();               //设置LED灯相关IO口
    
    while(1)                 //死循环
    {  
        LED3 = !LED3;         //流水灯，初始化时LED为熄灭执行后则点亮
        DelayMS(800);         
        LED2 = !LED2;         
        DelayMS(800);            
        LED1 = !LED1;        
        DelayMS(800);  
        
        for (i=0; i<2; i++)  //所有灯闪烁2次
        {
           LedOnOrOff(1);    //关闭所有LED灯
           DelayMS(200);
           LedOnOrOff(0);    //打开所有LED灯
           DelayMS(200);
        }
        
        LedOnOrOff(1);       //使所有LED灯熄灭状态
        DelayMS(500);
    }
}
