/****************************************************************************
* 文 件 名: main.c
* 作    者: Daniel Peng
* 修    订: 2022-4-10
* 版    本: 1.0
* 描    述: 继电器接开发板P9座子上，使用P1.3口控制继电器的信息端，
*           高电平继电器断开;低电平继电器吸合，并且继电器吸合指示灯亮 
****************************************************************************/
#include <ioCC2530.h>

typedef unsigned char uchar;
typedef unsigned int  uint;

#define RELY P1_3        //定义P1.3定义为输入口

#define BEEP P0_0        //定义P0.0定义为蜂鸣器控制口
/****************************************************************************
* 名    称: InitBeep()
* 功    能: 初始化蜂鸣器，默认关闭
* 入口参数: 无
* 出口参数: 无
****************************************************************************/
void InitBeep(void)
{
	P0DIR |= 0x01;    //P0.0定义为输出口 
	BEEP = 0;        //蜂鸣器灭
}

/****************************************************************************
* 名    称: DelayMS()
* 功    能: 以毫秒为单位延时 16M时约为535,系统时钟不修改默认为16M
* 入口参数: msec 延时参数，值越大，延时越久
* 出口参数: 无
****************************************************************************/
void DelayMS(uint msec)
{ 
    uint i,j;
    
    for (i=0; i<msec; i++)
        for (j=0; j<535; j++);
}


void main(void)
{    
	InitBeep();

    P1DIR |= 0x08;           //P1.3定义为输出口 
    while(1)                 //死循环,继电器间隔3秒开关一次
    {
        RELY = 1;        //继电器吸合
        DelayMS(1000);
        RELY = 0;        //继电器打开
        DelayMS(1000);
    }    
}
